app/controllers/bottles_controller.rb

SELECT * FROM "bottles"
---
  def index
    @bottles = Bottle.all

SELECT * FROM "bottles" WHERE ("bottles"."id" = 1)
---
  def show
    @bottle = Bottle.find(params[:id])

INSERT INTO "bottles" ("volume_unit", "glass_type", "price", "brewery", "created_at", "country", "cost", "updated_at", "sales_tax", "stock", "info", "volume", "display", "full_name", "display_name", "source", "abv", "style") VALUES('Milliliters', 'Tulip', 16.0, 'Nøgne Ø', '2010-08-21 00:47:13', 'no', 5.4, '2010-08-21 00:47:13', 9.0, 48, 'http://beeradvocate.com/beer/profile/7730/14507', 500.0, 't', 'India Pale Ale', 'Nøgne Ø IPA', 'Morris Distributing', 7.5, 'Ales')
---
  def create
    @bottle = Bottle.new(params[:bottle])
    if @bottle.save

SELECT * FROM "bottles" WHERE ("bottles"."id" = 1)
---
  def edit
    @bottle = Bottle.find(params[:id])

SELECT * FROM "bottles" WHERE ("bottles"."id" = 1)
UPDATE "bottles" SET "updated_at" = '2010-08-19 01:43:13', "sales_tax" = 9.0 WHERE "id" = 1
---
  def update
    @bottle = Bottle.find(params[:id])
    if @bottle.update_attributes(params[:bottle])

SELECT * FROM "bottles" WHERE ("bottles"."id" = 1)
DELETE FROM "bottles" WHERE "id" = 1
---
  def destroy
    @bottle = Bottle.find(params[:id])
    @bottle.destroy