app/controllers/draughts_controller.rb

SELECT * FROM "draughts"
---
  def index
    @draughts = Draught.all

SELECT * FROM "draughts" WHERE ("draughts"."id" = 1)
---
  def show
    @draught = Draught.find(params[:id])

INSERT INTO "draughts" ("volume_unit", "glass_type", "price", "brewery", "small_serving_size", "created_at", "country", "keg_cost", "serving_size", "updated_at", "sales_tax", "stock", "info", "volume", "display", "full_name", "display_name", "small_price", "source", "abv", "small_glass_type", "style") VALUES('Gallons', 'Willi Beecher', 8.0, 'North Coast', 250, '2010-08-21 19:15:35', 'us', 144.0, 500, '2010-08-21 19:15:35', 9.0, 2, 'http://beeradvocate.com/beer/profile/112/412', 15.5, 't', 'Old Rasputin', 'Old Rasputin', 5.0, 'Morris Distributing', 9.0, 'Small Willi Beecher', 'Stouts & Porters')
---
  def create
    @draught = Draught.new(params[:draught])
    if @draught.save

SELECT * FROM "draughts" WHERE ("draughts"."id" = 1)
---
  def edit
    @draught = Draught.find(params[:id])

SELECT * FROM "draughts" WHERE ("draughts"."id" = 1)
UPDATE "draughts" SET "updated_at" = '2010-08-14 06:12:06', "keg_cost" = 1550000, "price" = 80000 WHERE "id" = 1
---
  def update
    @draught = Draught.find(params[:id])
    if @draught.update_attributes(params[:draught])

SELECT * FROM "draughts" WHERE ("draughts"."id" = 1)
DELETE FROM "draughts" WHERE "id" = 1
---
  def destroy
    @draught = Draught.find(params[:id])
    @draught.destroy