app/controllers/drawers_controller.rb

SELECT * FROM "drawers"
---
  def index
    @drawers = Drawer.all

SELECT * FROM "drawers" WHERE ("drawers"."id" = 1)
---
  def show
    @drawer = Drawer.find(params[:id])

INSERT INTO "drawers" ("created_at", "updated_at", "user_id", "closed_at") VALUES('2010-08-14 18:48:05', '2010-08-14 18:48:05', NULL, NULL)
---
  def create
    @drawer = Drawer.new(params[:drawer])
    if @drawer.save

SELECT * FROM "drawers" WHERE ("drawers"."id" = 1)
DELETE FROM "drawers" WHERE "id" = 1
---
  def destroy
    @drawer = Drawer.find(params[:id])
    @drawer.destroy