app/controllers/foods_controller.rb

SELECT * FROM "foods"
---
  def index
    @foods = Food.all

SELECT * FROM "foods" WHERE ("foods"."id" = 1)
---
  def show
    @food = Food.find(params[:id])

INSERT INTO "foods" ("price", "created_at", "cost", "updated_at", "sales_tax", "display", "display_name") VALUES(600, '2010-08-14 18:36:34', 80, '2010-08-14 18:36:34', 0.09, 't', 'Tomato & Garlic')
---
  def create
    @food = Food.new(params[:food])
    if @food.save

SELECT * FROM "foods" WHERE ("foods"."id" = 1)
---
  def edit
    @food = Food.find(params[:id])

SELECT * FROM "foods" WHERE ("foods"."id" = 1)
UPDATE "foods" SET "updated_at" = '2010-08-14 18:44:35', "display_name" = 'Boquerones', "price" = 60000, "cost" = 16500 WHERE "id" = 2
---
  def update
    @food = Food.find(params[:id])
    if @food.update_attributes(params[:food])