app/controllers/ipads_controller.rb

SELECT * FROM "tabs" WHERE ("tabs"."id" = 3) LIMIT 1
SELECT * FROM "drawers" WHERE ("drawers"."closed_at" IS NULL)
---
  def index
    unless session['tab'].blank?
      @tab = Tab.find_by_id(session['tab'])
    end
    @user_session = UserSession.new
    @drawer = Drawer.find_all_by_closed_at(nil)

SELECT * FROM "purchases" WHERE ("purchases"."id" = '46') LIMIT 1
---
  def edit
    @purchase = Purchase.find_by_id(params[:id])