app/controllers/miscs_controller.rb

  def index
    @miscs = Misc.all
---
SELECT * FROM "miscs"

  def show
    @misc = Misc.find(params[:id])
---
SELECT * FROM "miscs" WHERE ("miscs"."id" = 1)

  def create
    @misc = Misc.new(params[:misc])
    if @misc.save
---
INSERT INTO "miscs" ("price", "created_at", "cost", "updated_at", "sales_tax", "info", "display", "display_name") VALUES(2.0, '2010-08-21 21:49:52', 1.0, '2010-08-21 21:49:52', 9.0, 'http://www.bluebottlecoffee.net/', 't', 'Blue Bottle Drip')