app/controllers/purchases_controller.rb

SELECT * FROM "purchases" ORDER BY purchases.id DESC LIMIT 1
---
  def index
    @purchases = Purchase.all

SELECT * FROM "purchases" WHERE ("purchases"."id" = 1)
---
  def show
    @purchase = Purchase.find(params[:id])

SELECT * FROM "tabs"
---
  def new
    @purchase = Purchase.new
    @tabs = Tab.all

INSERT INTO "purchases" ("alteration", "price", "created_at", "updated_at", "user_id", "purchasable_id", "alteration_user_id", "version", "tab_id", "purchasable_type") VALUES(NULL, NULL, '2010-08-15 04:20:15', '2010-08-15 04:20:15', 1, 1, NULL, NULL, 21, 'Food')
---
  def create
    if !params[:ipad].blank?
      @purchase = Purchase.new(params[:purchase])
      @purchase.save

SELECT * FROM "purchases" WHERE ("purchases"."id" = 51)
---
  def edit
    @purchase = Purchase.find(params[:id])

SELECT * FROM "purchases" WHERE ("purchases"."id" = 46)
UPDATE "purchases" SET "updated_at" = '2010-08-22 23:14:00', "alteration" = 'Justin Catalana' WHERE "id" = 46
---
  def update
    @purchase = Purchase.find(params[:id])
    respond_to do |format|
      format.html do
        if @purchase.update_attributes(params[:purchase])

SELECT * FROM "purchases" WHERE ("purchases"."id" = 1)
DELETE FROM "purchases" WHERE "id" = 1
---
  def destroy
    @purchase = Purchase.find(params[:id])
    @purchase.destroy