app/controllers/tabs_controller.rb

SELECT * FROM "tabs" ORDER BY tabs.id DESC LIMIT 1
---
  def index
    @tabs = Tab.all

SELECT * FROM "tabs" WHERE ("tabs"."id" = 1)
---
  def show
    @tab = Tab.find(params[:id])

INSERT INTO "tabs" ("name", "created_at", "updated_at", "user_id", "type", "closed_at", "drawer_id") VALUES('Jack', '2010-08-14 18:55:44', '2010-08-14 18:55:44', 1, NULL, NULL, NULL)
---
  def create
    @tab = Tab.new(params[:tab])
    if @tab.save

SELECT * FROM "tabs" WHERE ("tabs"."id" = 1)
DELETE FROM "tabs" WHERE "id" = 1
---
  def destroy
    @tab = Tab.find(params[:id])
    @tab.destroy