app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"

  def create
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "role", "password_salt", "persistence_token") VALUES('2010-08-14 02:50:21', '87bb484bfd780cd352a78b9288c2dc4afb11353db5b450a7b649b9890885c80445db784f4487b916d19fed6ab722759163773b8cab505a7793be1b61ce23eee9', '2010-08-14 02:50:21', 'Tyler Catalana', 'Admin', 'd5yb14NJC9HEbY8CxeEw', '6e022434f3dd023300490b0cf6c69feb97f6ff356d94304e9a42e122444f38375f583b7e62558ff9029277d224188cac3ffd40e28f688894405fd0100033572e')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "persistence_token" = 'bfad8ac7476b051a6eaa19d03ced03805e7ab5f644a8c7f741466850da553a83e5de8139af7d083f4951d6c60df40e02ccf0ed413024ebeb8750bf0f8fdcc035', "updated_at" = '2010-08-14 03:31:19', "password_salt" = '1CBNhSxcysDOlNiQYpRh', "crypted_password" = 'd56945b4523380eb3ae7d80623e099aec34cd0f215e2e94b318da9a96d7a4711b571a1daf49f93a32c1e4f57233cd1c3b44a295903ce51a1be16da11a568d333' WHERE "id" = 1

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "id" = 1